app/controllers/answers_controller.rb

SELECT * FROM "question" WHERE ("question"."id" = 1909853392)
---
  def new
    @answer = Answer.new
    @answer.question = Question.find(params[:question_id])

SELECT * FROM "answer" WHERE ("answer"."id" = 1920588793)
---
  def edit
    @answer = Answer.find(params[:id])

SELECT * FROM "answer" WHERE ("answer".question_id = 1909853392) ORDER BY priority ASC
SELECT * FROM "question" WHERE ("question"."id" = 1909853392)
SELECT count(*) AS count_all FROM "answer" WHERE ("answer".question_id = 1909853392)
INSERT INTO "answer" ("question_id", "created_at", "updated_at", "text", "priority") VALUES(1909853392, '2010-01-17 23:27:31.153271', '2010-01-17 23:27:31.153271', E'test answer', 3) RETURNING "id"
---
  def create
    @answer = Answer.new(params[:answer])
    @answer.question = Question.find(params[:question_id])

    @answer.priority = @answer.question.answers[(@answer.question.answers.size) -1].priority + 1

    if @answer.save

SELECT * FROM "answer" WHERE ("answer"."id" = 1920588793)
UPDATE "answer" SET "updated_at" = '2010-01-17 23:30:19.265767', "text" = E'changed answer' WHERE "id" = 1920588793
---
  def update
    @answer = Answer.find(params[:id])

    if @answer.update_attributes(params[:answer])

SELECT * FROM "answer" WHERE ("answer"."id" = 1920588793)
DELETE FROM "answer" WHERE "id" = 1920588793
---
  def destroy
    answer = Answer.find(params[:id])
    question = answer.question

    answer.destroy