app/controllers/answers_controller.rb

SELECT * FROM "answer"
---
  def index
    @answers = Answer.all