app/controllers/learning_schemas_controller.rb

  def index
    @learning_schema = LearningSchema.all
---
SELECT * FROM "learning_schema"