app/controllers/learning_controller.rb

SELECT * FROM "lesson" WHERE ("lesson"."id" = 1)
---
  def learn
    lesson = Lesson.find(params[:lesson_id])

SELECT * FROM "question" WHERE ("question"."id" = 3)
---
  def question
    @attempt = session[:attempt]

    if params[:mark_correct]
      @mark_correct = [params[:mark_correct]]
    end
    if params[:mark_repeat]
      @mark_repeat = [params[:mark_repeat]]
    end

    if @attempt.questionsToLearn.size > 0
      @question = Question.find(@attempt.questionsToLearn[0])

SELECT * FROM "question" WHERE ("question"."id" = 3)
---
  def check
    @question = Question.find(params[:question_id])

SELECT * FROM "question" WHERE ("question"."id" = 4)
UPDATE "question" SET "updated_at" = '2010-01-10 15:48:25.138164', "level_id" = 10, "last_level_update" = '2010-01-10 15:48:25.120667' WHERE "id" = 1
---
  def correct
    @attempt = session[:attempt]
    passed = @attempt.correct(params[:question_id])

    if passed
      q = Question.find(passed)
      q.next_level

      q.save!