app/controllers/lessons_controller.rb

  def index
    @lessons = Lesson.all
---
SELECT * FROM "lesson"

  def show
    sort_order = "ASC"
    sort_order = params[:sort_order] if params[:sort_order]

    sort_column = "next_attempt_date"
    sort_column = params[:sort_column] if params[:sort_column]

    out_sort = ", id DESC"
    out_sort = ", next_attempt_date ASC " + out_sort unless sort_column.include? "next_attempt_date"

    @lesson = Lesson.find(params[:id])
    @questions = Question.paginate :page => params[:page], :per_page => 10,
                      :conditions => {:lesson_id => @lesson},
                      :order => "#{sort_column} #{sort_order} #{out_sort}",
                      :joins => "left join level l on \"question\".level_id = l.id left join answer a on \"question\".id = a.question_id and a.priority = 1"
---
SELECT * FROM "lesson" WHERE ("lesson"."id" = 666426138)
SELECT * FROM "lesson"
SELECT * FROM "question" WHERE ("question"."lesson_id" = 666426138) ORDER BY next_attempt_date ASC, level_id DESC, created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "question" WHERE ("question".lesson_id = 666426138)

  def edit
    @lesson = Lesson.find(params[:id])
---
SELECT * FROM "lesson" WHERE ("lesson"."id" = 666426138)

  def create
    @lesson = Lesson.new(params[:lesson])

    respond_to do |format|
      if @lesson.save
---
INSERT INTO "lesson" ("name", "created_at", "updated_at", "learning_schema_id", "description") VALUES(E'just created', '2010-01-17 20:50:06.793895', '2010-01-17 20:50:06.793895', 1667104992, NULL) RETURNING "id"

  def update
    @lesson = Lesson.find(params[:id])

    respond_to do |format|
      if @lesson.update_attributes(params[:lesson])
---
SELECT * FROM "lesson" WHERE ("lesson"."id" = 666426138)
UPDATE "lesson" SET "updated_at" = '2010-01-17 20:58:20.573905', "name" = E'changed lesson name' WHERE "id" = 666426138

  def destroy
    @lesson = Lesson.find(params[:id])
    @lesson.destroy
---
SELECT * FROM "lesson" WHERE ("lesson"."id" = 666426138)
DELETE FROM "lesson" WHERE "id" = 666426138