app/controllers/levels_controller.rb

SELECT * FROM "level"
---
  def index
    @level = Level.all