app/controllers/questions_controller.rb

SELECT * FROM "question" WHERE ("question"."id" = 1909853392)
---
  def show
    @question = Question.find(params[:id])

SELECT * FROM "lesson" WHERE ("lesson"."id" = 666426138)
---
  def new
    @question = Question.new
    @question.lesson = Lesson.find(params[:lesson_id])

SELECT * FROM "question" WHERE ("question"."id" = 1909853392)
---
  def edit
    @question = Question.find(params[:id])

SELECT * FROM "lesson" WHERE ("lesson"."id" = 666426138)
INSERT INTO "answer" ("question_id", "created_at", "updated_at", "text", "priority") VALUES(1909853393, '2010-01-17 22:16:22.699569', '2010-01-17 22:16:22.699569', E'test answer', 1) RETURNING "id"
INSERT INTO "question" ("level_id", "created_at", "lesson_id", "updated_at", "next_attempt_date", "text", "last_attempt_date", "active") VALUES(1649692261, '2010-01-20 17:41:56.737318', 666426138, '2010-01-20 17:41:56.737318', '2010-01-20 17:41:56.721460', E'test question', '2010-01-20 17:41:56.708583', 't') RETURNING "id"
---
  def create
    @question = Question.new(params[:question])

    @question.lesson = Lesson.find(params[:lesson_id])
    @question.level = @question.lesson.learning_schema.start_level
    @question.last_attempt_date = Time.now.utc
    @question.next_attempt_date = Time.now.utc

    @answer = Answer.new(params[:answer])
    @answer.priority = 1
    @answer.question = @question

    if @answer.valid?
      @question.answers << @answer

SELECT * FROM "question" WHERE ("question"."id" = 1909853392)
UPDATE "question" SET "updated_at" = '2010-01-17 22:57:03.198413', "text" = E'home222' WHERE "id" = 1909853392
---
  def update
    @question = Question.find(params[:id])

    if @question.update_attributes(params[:question])

SELECT * FROM "question" WHERE ("question"."id" = 1909853392)
DELETE FROM "question" WHERE "id" = 1909853392
---
  def destroy
    question = Question.find(params[:id])
    lesson = question.lesson

    question.destroy